Catalogs/ГруппыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ГруппыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаУсловий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
					<Comment>Совершаемые действия</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьЗавершения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыДействий/Ext/ManagerModule.bsl
Процедура ВыполнитьГруппуДействий(ЭлементСправочника) Экспорт
	
	ГруппаУсловийВыполняется = Истина;
	Если ЗначениеЗаполнено(ЭлементСправочника.ГруппаУсловий) Тогда 
		ГруппаУсловийВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(ЭлементСправочника.ГруппаУсловий);
	КонецЕсли;
	Если ГруппаУсловийВыполняется Тогда 
		Для Каждого Строка Из ЭлементСправочника.Действия Цикл
			ГруппаУсловийДействияВыполняется = Истина; 
			Если ЗначениеЗаполнено(Строка.ГруппаУсловий) Тогда
				ГруппаУсловийДействияВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(Строка.ГруппаУсловий);
            КонецЕсли;
			Если ГруппаУсловийДействияВыполняется Тогда	
				МассивСДействием = Новый Массив();
				МассивСДействием.Добавить(Строка.Действие);
				Если Строка.ОжидатьЗавершения Тогда		
					Справочники.Действия.ВыполнитьДействия(МассивСДействием);	
				Иначе
					МассивСПараметрамиДляДействий = Новый Массив();
					МассивСПараметрамиДляДействий.Добавить(МассивСДействием);
					ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Справочники.Действия.ВыполнитьДействия", МассивСПараметрамиДляДействий);	
				КонецЕсли;												
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;			
	
КонецПроцедуры
